       01  EMPLOYEE.
           05  EMP-ID               PIC 9(5).
           05  NAME                 PIC X(20).
           05  DEPT                 PIC X(10).
           05  HIRE-DATE            PIC 9(8).
           05  SALARY               PIC 9(7)V99.
           05  PHONE                PIC 9(10).
           05  EMAIL                PIC X(25).
           05  STATE                PIC X(2).
           05  BONUS                PIC 9(5)V99.
           05  ACTIVE               PIC X(1).
