       01  EMPLOYEE.
           05  EMP-ID               PIC 9(5).
           05  NAME                 PIC X(20).
           05  DEPT                 PIC X(10).
           05  HIRE-DATE            PIC 9(8).
           05  SALARY               PIC 9(7)V99.